<!DOCTYPE html>
<html lang="ar" dir="rtl">

<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>python</title>
    <link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.rtl.min.css" integrity="sha384-gXt9imSW0VcJVHezoNQsP+TNrjYXoGcrqBZJpry9zJt8PCQjobwmhMGaDHTASo9N" crossorigin="anonymous">
<link rel="stylesheet" href="style.css">
</head>
<body>
<nav class="navbar navbar-expand-lg navbar-light bg-light">
    
    <div class="container-fluid">
        
        <a class="navbar-brand" href="#"><img src="py.webp" alt=""></a>
        <a class="navbar-brand" href="#"><img src="a.png" alt=""></a>
        
        <button class="navbar-toggler" type="button" data-bs-toggle="collapse" data-bs-target="#navbarNav"
            aria-controls="navbarNav" aria-expanded="false" aria-label="Toggle navigation">
            
            <span class="navbar-toggler-icon"></span>
            
        </button>
        
        <div class="collapse navbar-collapse" id="navbarNav">
            
            <ul class="navbar-nav">
                <li class="nav-item">
                    <a class="nav-link active" aria-current="page" href="mailto:atifbeko999@gmail.com">الايميل</a>
                </li>
                <li class="nav-item">
                    <a class="nav-link" href="https://www.youtube.com/channel/UCRKP5mDEnRC2xlR_6RJPdTA">اليوتيوب</a>
                </li>
                
                </li>
            </ul>
           
                <h5 style="text-align: left; margin:0 auto; color: #000; width: 100%;">كليه الامارات للعلوم والتكنولوجيا</h5>
           
        </div>
    </div>
</nav>
<br>
<br>
<br>
<br>
<br>
<table border="2"  class="table caption-top">
            <tr>
            
                <td>الاسم</td>
                <td>عاطف ابكر عبدالوهاب محمد</td>
            
            </tr>
            <tr>
            
                <td>الجامعه</td>
                <td>كليه الامارات للعلوم والتكنولوجيا</td>
            
            </tr>
            <tr>
            
                <td>التخصص</td>
                <td>ب/تقنيه المعلومات</td>
            
            </tr>
            <tr>
            
                <td>المستوى</td>
                <td>الرابع</td>
            
            </tr>
            <tr>
            
                <td>المحتوى</td>
                <td>بحث عن لغه بايثون</td>
            
            </tr>
     
</table>
<hr>
<div class="pp">
    <h2>البايثون</h2>
    <p>هي لغة برمجة، عالية المستوى سهلة التعلم مفتوحة المصدر قابلة للتوسيع، تعتمد أسلوب البرمجة الكائنية (OOP). لغة بايثون هي
    لغة مُفسَّرة، ومُتعدِدة الاستخدامات، وتستخدم بشكل واسع في العديد من المجالات، كبناء البرامج المستقلة باستخدام الواجهات
    الرسومية وفي تطبيقات الويب، ويمكن استخدامها كلغة برمجة نصية للتحكم في أداء العديد من البرمجيات مثل بلندر. بشكل عام، يمكن
    استخدام بايثون لعمل البرامج البسيطة للمبتدئين، ولإنجاز المشاريع الضخمة في الوقت نفسه. غالباً ما يُنصح المبتدؤون في ميدان
    البرمجة بتعلم هذه اللغة لأنها من بين أسرع اللغات البرمجية تعلماً. طُوِّرت بايثون في معهد الرياضيات والمعلوماتية الهولندي
    (CWI) في مدينة أمستردام على يد جايدو فان روسم في أواخر ثمانينات القرن العشرين، وكان أول إعلان عنها في عام 1991م. كُتبت
    نواة اللغة باستعمال لغة سي. أطلق روسم الاسم "بايثون" على لغته تعبيرًا عن إعجابه بفِرقَة مسرحية هزلية شهيرة من بريطانيا،
    كانت تطلق على نفسها اسم مونتي بايثون. تتميز بايثون بمجتمعها النشط، كما أن لها الكثير من المكتبات البرمجية ذات الأغراض
    الخاصة التي برمجها أشخاص من ذلك المجتمع. مثلاً، هناك مكتبة باي جايم التي توفر مجموعة من الدوال من أجل برمجة الألعاب.
    يمكن لبايثون أيضاً التعامل مع العديد من أنواع قواعد البيانات مثل ماي إس كيو إل وغير ذلك. تدعم بايثون أنماط برمجية متعددة
    هي التوجيه الكائني، البرمجية جانبية التوجيه والبرمجة الوظيفية. تُستخدم بايثون عادةً مثل العديد من لغات البرمجة
    الديناميكية كلغة برمجة نصية. بايثون لديها نموذج مفتوح للتطوير، قائم على مجتمع بايثون البرمجي ومدعوم من مؤسسة برمجيات
    بايثون. والتي تحافظ على تعريف اللغة في التنفيذ المرجعي لسي بايثون.</p>
</div>

<hr>
<div class="hestory">
    <h3>تاريخ البايثون</h3>
    <p>ظهرت لغة بايثون في أواخر الثمانينيات على يد غيدو فان روسوم (Guido van Rossum)، وقد عُدَّت خليفةً للغة ABC). كما استفادت
    من الكثير من اللغات السابقة لها، مثل Modula-3 و C و C++‎ و Algol-68 و SmallTalk، وغيرها من اللغات.
    
    نُشِر الإصدار 2.0 من لغة بايثون عام 2000، وقد قدّم العديد من الميزات الجديدة، مثل القوائم الفهمية (List Comprehensions)،
    ونظام كنس المُهملات (garbage collection). وفي عام 2008، ظهر الإصدار بايثون 3.0، والذي شكّل طفرة في اللغة، بيْد أنه لم
    يكن متوافقًا تمامًا مع الإصدارات السابقة، لذلك قرر فريق التطوير الاستمرار في دعم إصدار أخير من سلسلة بايثون ‎2.x‎، وهو
    بايثون 2.7 حتى عام 2020.</p>
</div>
<hr>
<ul class="list-group">
    <li class="list-group-item active" aria-current="true">مميزات لغه بايثون</li>
    <li class="list-group-item">سهولة التعلم: يسهل تعلم لغة بايثون، إذ تتألف من عدد قليل من الكلمات المفتاحية، وتتميز بصياغة بسيطة وواضحة.</li>
    <li class="list-group-item">المقروئية: شيفرة لغة بايثون واضحة ومنظمة وسهلة القراءة.</li>
    <li class="list-group-item">سهلة الصيانة: شيفرة بايثون سهلة الصيانة إلى حد بعيد.</li>
    <li class="list-group-item">مكتبة قياسية واسعة: تحتوي مكتبة بايثون القياسية على عدد كبير من الحزم المحمولة التي تتوافق مع أنظمة UNIX و Windows و
    macOS.</li>
    <li class="list-group-item">الوضع التفاعلي: تدعم بايثون الوضع التفاعلي، مما يتيح إمكانية تنفيذ الشفرات مباشرةً على سطر الأوامر وتنقيح الشفرات</li>
    <li class="list-group-item">محمولية بايثون: يمكن تشغيل لغة بايثون على طيف واسع من المنصات والأجهزة، مع الاحتفاظ بنفس الواجهة على جميع تلك المنصات.</li>
    <li class="list-group-item">التوسُّعية: من أهم مميزات بايثون، هو توفرها على عدد هائل من الوحدات، التي يمكنها توسيع قدرات اللغة في كل مجالات التطوير،
    مثل تحليل البيانات والرسوميات ثنائية وثلاثية الأبعاد، وتطوير الألعاب، والأنظمة المدمجة، والبحث العلمي، وتطوير المواقع
    وغيرها من المجالات.</li>
    <li class="list-group-item">قواعد البيانات: توفر بايثون واجهات لجميع قواعد البيانات الأساسية.</li>
    <li class="list-group-item">الرسوميات: تدعم بايثون التطبيقات الرسومية.</li>
    <li class="list-group-item">دعم البرامج الكبيرة: بايثون مناسبة للبرامج الكبيرة والمعقدة.</li>
</ul>
<hr>
<div class="use">
    <h5>اين تستخدم لغه البايثون</h5>
    <p>تُستخدم لغة بايثون في كل المجالات، فهي لغة برمجة متعددة الأغراض، ومن مجالات استخدامها: تحليل البيانات، والروبوتات، وتعلم
    الآلة، وتطبيقات REST، وتطوير المواقع والألعاب، والرسوم ثلاثية الأبعاد، والأتمتة وبرمجة الأنظمة المدمجة، والكثير من
    المجالات الأخرى التي لا يسعنا حصرها هنا.
    
    تستخدم الكثير من المواقع والشركات العملاقة لغة بايثون، ومنها Spotify و Google وAmazon، إضافة إلى Facebook التي تستخدم
    بايثون لمعالجة الصور. وفي كل يوم تتحول شركات جديدة إلى استخدام بايثون، مثل Instagram التي قررت مؤخرًا استخدامها وفضلتها
    على PHP. تُستخدم بايثون أيضًا من قبل بعض الجهات العلمية والبحثية، مثل وكالة الفضاء الأمريكية ناسا، والتي لها</p>
</div>
<hr>
<div class="why">
    <h4>لماذا بايثون</h4>
    <p>إنّ تحديد أفضل لغة برمجة للتعلم قد يكون مهمةً صعبةً. لو سألت عدة أشخاص عن لغة البرمجة التي يجب تعلمها، فستحصل على عدة
    إجابات، ويكفي أن تدخل على جوجل وتكتب أفضل لغة برمجة، وستجد آراءً مختلفةً، وجدالًا لا ينتهي حول هذا الموضوع.
    
    لا أريد أن أبدأ حرب لغات البرمجة هنا، ولكني سأحاول في هذه الفقرة تقديم بعض الحجج لتبرير لماذا أرى أنّ بايثون هي لغة
    المستقبل، وأن تعلم لغة بايثون مثالي للمبتدئين الذين يريدون دخول عالم البرمجة وعلوم الحاسوب.</p>
</div>
<hr>
<div class="lap">
    <h2>مكتبات بايثون</h2>
    <br>
<h4>مكتبة Requests</h4>

إذا كنت ترغب بإنشاء اتصال عبر بروتوكول HTTP، فإن هذه المكتبة هي خيارك المناسب للقيام بذلك وبشكل أتوماتيكي دون الحاجة إلى
الجهد اليدوي في ذلك وبالتالي يتم استخدام هذه المكتبة عند طلب صفحة HTML، فهي تقوم بمعرفة كل ما يقوم به المتصفح في الخلفية
وبالتالي تعطيك المعلومات والتوثيق الكامل للاتصال والقوة الكاملة للتعامل مع أي استعلام يعتمد على برتوكول HTTP. فهي قوية
وسهلة الاستخدام وكل ذلك عن طريق urllib3 (المكتبة الأم للمكتبة request).
<br>
<br>

<h4>المكتبة Pluggy</h4>
تعتبر من المكتبات الجديدة نسبياً في لغة بايثون وتعطيك المرونة اللازمة للتعامل مع الملحقات (الإضافات) من إضافة وتعديل
وإدارة، حيث تمكّنك من التعامل مع أكثر من 500 إضافة (أو ما يسمى Plugin) وبالتالي فهي تعطيك قوة كبيرة جداً لتطبيقك البرمجي
بحيث تمكّنك من التعامل مع البرنامج المضيف وكأنه جزء من الكود البرمجي الخاص بك.
<br>
<br>
<h4>مكتبة Scappy</h4>
تعتبر Scappy أداة قوية ومهمة لمعالجة بيانات الحزم المرسلة، حيث تمكّنك من التقاط تلك الحزم وبالتالي تحليلها والتعرف على
محتواها، وهي قادرة على القيام بالعديد من المهام المتعلقة باكتشاف الشبكة وعمليات التتبع وإرسال الإطارات الخاطئة والحقن
لغايات الاختراق والأمان، وكذلك الدمج بين مجموعة من التقنيات (مثل VLAN مع ARP وغيرها) و لعل أكثر من يهتم بهذه المكتبة هم
مستخدمو نظام التشغيل لينوكس.
<br>
<br>
<h4>مكتبة Beautiful Soup</h4>
تستخدم هذه المكتبة بشكل رئيسي لاستخراج المعلومات من صفحة HTML كما تفيد في تحويل البيانات غير المنسقة (غير المهيكلة) إلى
بيانات منسقة بترميز UTF-8 (وهو الترميز القياسي العالمي للمحارف)، ليس هذا فحسب بل إنها أيضاً تعطيك القوة والإمكانية
للتحويل بين أنواع مختلفة من ملفات البيانات (مثل ملفات XML) فهي قادرة على التعامل مع أنواع مهمة جداً من البيانات وخاصة
XML (وكذلك ملفات HTML) بسهولة وبالتالي فهي توفر على المبرمج الكثير من الوقت والجهد.
<br>
<br>
<h4>مكتبة SQLAlchemy</h4>
تعطي هذه المكتبة مبرمجي بايثون القوة والمرونة الكاملة للتعامل مع لغة الاستعلامات المهيكلة SQL، وتمكنك هذه المكتبة من
إجراء العمليات الرئيسية في التعامل مع قواعد البيانات من نوع SQL من عمليات الوصول والتعديل وغيرها فهي تنظر إلى قاعدة
البيانات ليس فقط كمجموعة من الجداول بل أيضاً كمجموعة من العلاقات التي يمكنك عبرها تجميع البيانات والحصول عليها من
الجداول.
<br>
<br>
<h4>مكتبة Matplotlib</h4>
إذا كنت كمبرمج بايثون بحاجة إلى الطباعة ثنائية البعد أي تريد رسم مخططات معينة سواء أكانت مخططات رياضية أو مخططات إحصائية
(كمخططات barchart ومخططات Pies)، فأنت بحاجة إلى هذه المكتبة الرائعة لتضمنها ضمن الكود البرمجي الخاص بك، ليس هذا فحسب بل
إنها تقدم لك أيضاً القدرة على إظهار مخططات صورية وخطية وكذلك مخططات ملونة ومجموعة كبيرة من المخططات الأخرى
<br>
<br>
<h4>مكتبة pygame</h4>
من منا لا يحب أن يبرمج لعبة أو خطر بباله ذلك يوماً ما؟ أعتقد أن الأغلبية تحلم بذلك، فإن كنت مبرمج بايثون يمكنك ببساطة
تصميم الألعاب ثنائية البعد بالاعتماد على هذه المكتبة الرائعة، والتي تعتبر من المكتبات الشهيرة والقوية في تطوير الألعاب
ثنائية البعد في بيئة البايثون. وهي مفتوحة المصدر ومجانية أيضاً وما تقدمه لك هذه المكتبة ليس فقط تطوير الألعاب بل تساعدك
في أي تطبيق وسائط متعددة تريد تطويره باستخدام بايثون. 
<br>
<br>
<h4>مكتبة pyGtk</h4>
إن كنت تبحث عن تصميم تطبيقات بواجهات المستخدم الرسومية (GUI) ونقصد بواجهات المستخدم الرسومية الإطارات والأزرار والحقول
وغيرها من العناصر المرئية، فإن هذه المكتبة أحد الخيارات المهمة المتاحة أمامك والتي تقدم لك الإمكانيات الكاملة لبناء
تطبيقات الواجهات الرسومية، ومن أشهر البرامج التي تم بناؤها بالاعتماد عليها تطبيق BitTorrent الشهير فلا تتردد بالحصول
عليها واستخدامها في تطبيقاتك.

</div>
</body>
</html>